<h1>The Report</h1>

You are given two tables: Students and Grades. Students contains three columns ID, Name and Marks.

<img src = 'https://s3.amazonaws.com/hr-challenge-images/12891/1443818166-a5c852caa0-1.png'></img>

Grades contains the following data:

<img src = 'https://s3.amazonaws.com/hr-challenge-images/12891/1443818137-69b76d805c-2.png'></img>

Ketty gives Eve a task to generate a report containing three columns: Name, Grade and Mark. Ketty doesn't want the NAMES of those students who received a grade lower than 8. The report must be in descending order by grade -- i.e. higher grades are entered first. If there is more than one student with the same grade (8-10) assigned to them, order those particular students by their name alphabetically. Finally, if the grade is lower than 8, use "NULL" as their name and list them by their grades in descending order. If there is more than one student with the same grade (1-7) assigned to them, order those particular students by their marks in ascending order.

Write a query to help Eve.

<h3>Sample Input</h3>

<img src = 'https://s3.amazonaws.com/hr-challenge-images/12891/1443818093-b79f376ec1-3.png'></img>

<h3>Sample Output</h3>

Maria 10 99 \
Jane 9 81 \
Julia 9 88 \
Scarlet 8 78 \
NULL 7 63 \
NULL 7 68

Note

Print "NULL"  as the name if the grade is less than 8.

<h3>Explanation</h3>

Consider the following table with the grades assigned to the students:

<img src = 'https://s3.amazonaws.com/hr-challenge-images/12891/1443818026-0b3af8db30-4.png'></img>

So, the following students got 8, 9 or 10 grades:

* Maria (grade 10)
* Jane (grade 9)
* Julia (grade 9)
* Scarlet (grade 8)

<h1>Code</h1>

In [ ]:
SELECT
CASE WHEN B.Grade >7 THEN A.Name
ELSE NULL
END AS NAMES
, B.Grade, A.Marks
FROM Students AS A
LEFT JOIN Grades AS B
ON (A.Marks >= B.Min_Mark AND A.Marks <= B.Max_Mark)
ORDER BY B.Grade DESC, NAMES ASC